# Задача 3. Неверная программа
# Ниже приведена программа, которая должна запрашивать фамилию пользователя и выводить её на экран.
# Но её написали неправильно. Скопируйте программу в редактор и исправьте все ошибки. Убедитесь, что программа работает.
# sur name = inpu('Введите фамилию: ')
# print('Ваша фамилия - ')
# print('sur name')

sur_name = input('Введите фамилию: ')
print('Ваша фамилия - ', sur_name)