# Задача 3. Животные
# Что нужно сделать
# Создайте две переменные с именами «Первое животное» и «Второе животное» на английском языке.
# Запишите в первую переменную слово «Заяц», а во вторую — «Черепаха». Используя эти переменные,
# выведите на экран текст «Заяц спит, Черепаха идёт» в одну строку.
# Что оценивается
# •	Input содержит корректное приглашение для ввода: input() — неверно.
# •	Переменные имеют значащие имена, не только a, b, c, d (видео 2.3).
# •	После запятой стоит пробел, перед запятой пробела нет.
# •	Отсутствие пробелов после print и перед скобками: print () — неверно, print() — верно.

first_animal = 'Rabbit'
second_animal = 'Turtle'
print(first_animal, ' is sleeping, ', second_animal, 'is going.')