# Задание 4. Марсоход-2
# К роботу Валли отправили «коллегу» Билли. Это его первая высадка на Марс,
# поэтому его тестируют в пря-моугольном помещении размером 15 × 20 м.
# Марсоход высаживается в центре комнаты (в точке 8, 10), за-тем управление
# им передаётся оператору, то есть пользователю вашей программы.
# Программа спрашивает, в какую сторону оператор хочет направить робота:
# север (клавиша W), юг (клавиша S), запад (клавиша A) или восток (клавиша D).
# Оператор делает выбор, марсоход перемещается в эту сторо-ну на один метр,
# а программа сообщает новую позицию робота. Если марсоход упёрся в стену,
# он не дол-жен пытаться переместиться в сторону стены — в этом случае его
# позиция не меняется.
# Что нужно сделать
# Создайте программу для управления роботом Билли.
# Пример:
# [Программа]: Марсоход находится на позиции 6, 19, введите команду:
# [Оператор]: A
# [Программа]: Марсоход находится на позиции 5, 19, введите команду:
# [Оператор]: W
# [Программа]: Марсоход находится на позиции 5, 20, введите команду:
# [Оператор]: W
# [Программа]: Марсоход находится на позиции 5, 20, введите команду:

