# Задача 3. Деление на ноль
# Проверим школьное правило «На ноль делить нельзя». Напишите программу,
# которая выводит результат деления числа (например 65) на ноль. Какой будет ответ?
# Тизер к заданию
# Правильный ответ: деление на ноль в питоне порождает ошибку ZeroDivisionError,
# это означает, что на ноль делить нельзя. Однако в будущем мы узнаем,
# что делить на ноль всё-таки можно — и даже получать беско-нечность,
# но это уже совсем другая история :)

print(65/0)