# Задача 1. Квадраты чисел
# Напишите программу, которая выводит квадраты чисел от 0 до 10.
# Для этого используйте цикл for и функцию range.

for num in range(0, 11):
    print(f'{num}^2 = {num ** 2}')