# Задача 3. Следующее и предыдущее числа
# Что нужно сделать
# Напишите программу, которая получает от пользователя число и выводит на экран
# два ответа — следующее и предыдущее числа. Результат:
#

num = int(input('Enter num: '))

print(f'After {num} is {num+1}')
print(f'Before {num} is {num-1}')