# Задача 1. Выражения
# Третьекласснику Вове задали домашнее задание по математике,
# и папа-программист сказал, что вечером обязательно проверит его.
# Но Вове лень считать, поэтому он пишет программы на Python.
# Посчитайте и последовательно выведите на экран значения математических выражений,
# по одному в каж-дой строчке, чтобы Вове не досталось от папы:
# •	6 умножить на 39;
# •	3 в степени 5;
# •	Минус 8 разделить на минус 4;
# •	10 разделить на 2 и прибавить 6.

print('6 x 39 =', 6 * 39)
print('3 ^ 5 =', 3 ** 5)
print('-8 / -4 =', (-8) / (-4))
print('10 / 2 + 6 =', 10 / 2 + 6)