# Задание 2
# 1.	Дополните программу из предыдущего задания так, чтобы она вывела в консоль приветствие,
# ваше имя и любимый цвет в отдельных строчках. Затем запустите программу и проверьте результат.
# 2.	Теперь попробуйте поменять местами строчки программы, например первую и третью.
# В результате выведется сначала цвет, затем имя и в конце — приветствие.

print('My favorite colour is red-white.')
print('My name is Lev.')
print('Hello, World!')