# Задание 1
# Повторите действия из урока и создайте программу, которая выводит в консоль текст Hello World!:
# •	Зайдите в repl.it.
# •	Создайте новый проект, язык Python.
# •	В examples выберите пример Hello World.
# •	Запустите программу, посмотрите, что она выводит в консоль.
# Теперь измените программу, чтобы она выводила фразу ‘Привет Мир!’:
# •	Замените Hello World! на нужный текст.
# •	Запустите программу ещё раз, убедитесь, что всё работает.

print('Hello, World!')