# Задача 4. Вход в систему
# Что нужно сделать
# Исправьте программу и допишите необходимые команды для получения нужного результата.
# Будьте вни-мательны при исправлении и помните о правилах названия переменных.
# Программа:
# first name = input('Введите имя пользователя: ')
# grииting = 'Утро доброе'
# print(greeting, first name)
# intro = "К сожалению, у Вас нет доступа к системе."
# info == "Пожалуйста, обратитесь к системному администратору."
# Ожидаемый результат:
#
# Что оценивается
# •	Результат вывода соответствует картинке.
# •	Переменные имеют значащие имена, не только a, b, c, d (видео 2.3).
# •	Нет смешения символов из разных алфавитов в именах переменных.
# •	Пробелы после запятых, пробелы при бинарных операциях.
# •	После запятой стоит пробел, перед запятой пробела нет.
# •	Отсутствуют пробелы после print и перед скобками: print () — неверно, print() — верно.
# •	Нет пробелов и внутри скобок.

first_name = input('Enter username: ')
greeting = 'Good morning'
print(greeting, ', ', first_name, '!')
print('Unfortunately, you don`t have access to the System.')
print('Please contact your system administrator.')