# Задача 1. Моя первая переменная
# Создайте переменную, присвойте ей текст «Моя первая переменная!» и выведите значение переменной на экран. Для этого:
# 1. Назовите переменную, используйте только буквы латинского алфавита. Пример имени: first.
# 2. После этого сделайте присваивание (знак = ).
# 3. Вставьте нужный текст.
# 4. Вставьте команду вывода переменной на экран в следующей строке программы. Кавычки здесь не нуж-ны.
# 5. Запустите программу и убедитесь, что в консоль выводится сообщение: «Моя первая переменная!»

first = 'My 1st var!'
print(first)
