# Задача 1. Приветствие пользователя
# Повторите действия из урока и создайте программу, которая запрашивает у пользователя имя и затем
# выво-дит для него приветствие. Для этого:
# •	Создайте переменную и присвойте ей команду input(). Внутри скобок команды напишите приглаше-ние,
# например: «Введите имя».
# •	В следующих двух строках напишите вывод приветствия и переменной на экран.
# •	Запустите программу, введите в консоль имя и нажмите Enter.
# •	Убедитесь, что программа работает верно.

name = input('Enter your name: ')
print('Hello, ', name)