# Задача 2. Две переменные
# Продолжая предыдущую программу, создайте ещё одну переменную с другим именем (например second),
# присвойте ей значение «И не последняя!» и выведете её на экран. В результате работы программы в консоли должно
# отобразиться две строки: «Моя первая переменная!» и «И не последняя!»

first = 'My 1st var!'
second = 'And not last one!'

print(first)
print(second)