# Задача 2. Приветствие для двух пользователей
# Продолжая предыдущую программу, запросите у пользователя второе имя и выведите второе приветствие на экран.

name_1 = input('Enter 1st name: ')
print('Hello, ', name_1)

name_2 = input('Enter 2nd name: ')
print('Hello, ', name_2)