# Задача 3. Склейка
# Что нужно сделать
# Напишите программу, которая запрашивает на вход два слова, записывает их в разные переменные,
# затем склеивает их и выводит на экран полученную строку.
#
# Результат будет такой:
# Введите первое слово: Всем
# Введите второе слово: привет
# Всем привет

first_word = input('Enter 1st word: ')
second_word = input('Enter 2nd word: ')
print(first_word + ' ' + second_word)

