# Задача 2. Конкатенация
# Что нужно сделать
# 1.	Используя программу из предыдущего задания, добавьте вывод восклицательного знака в конец приветственной строки.
# Проверьте программу.
# 2.	Затем попробуйте использовать конкатенацию для вывода строки. Для этого в команде print уберите запятые
# между объектами и вместо них поставьте знак «+». Снова проверьте программу. Результат должен быть такой же.

name = input('Enter your name: ')
print('Hello, ', name, '!')
print('Hello, ' + name + '!')