# Задача 6. Абстрактный класс
# Контекст
# Вы работаете в компании, занимающейся разработкой программного обеспечения для архитектурных проектов. Вам необходимо
# разработать программу для расчёта площади различных геометрических фигур, таких как круги, прямоугольники
# и треугольники.
# Задача
# Создайте:
# класс Shape, который будет базовым классом для всех фигур и будет хранить пустой метод area, который наследники
# должны переопределить;
# класс Circle;
# класс Rectangle;
# класс Triangle.
# Классы Circle, Rectangle и Triangle наследуют от класса Shape и реализуют метод для вычисления площади фигуры.
# Дополнительно: изучите информацию о работе с абстрактными классами.
# На основе этой информации сделайте так, чтобы:
# Нельзя было создавать объекты класса Shape.
# Наследники класса Shape переопределяли его метод area, чтобы объекты этих классов можно было использовать.

# TODO
