# Задача 1. Python!
# Напишите программу, которая выводит в отдельную строчку каждый символ фразы “Python!”.

word = 'Python!'

for sym in word:
    print(sym)
