# Задача 4. Площадь треугольника
# Что нужно сделать
# Напишите программу, которая запрашивает у пользователя длины двух катетов
# в прямоугольном треуголь-нике и выводит его площадь.
#

a = float(input('a = '))
b = float(input('b = '))

square = a * b / 2

print('S = ', square)