# Задача 2. Очень простая задача
# У вас есть список numbers. Напишите программу, которая заполняет список числами
# от 0 до 100 и выводит его на экран.

numbers = []
for num in range(101):
    numbers.append(num)
print(numbers)